import { useState } from "react";
import Header from "@/components/Header/Header.jsx";
import Section from "@/components/Section/Section.jsx";

function App() {
  const [count, setCount] = useState(0);

  return (
    <>
      <Header
        showHome={false}
        title="Приватний автоінструктор"
        subtitle="автоматична коробка передач"
        homeHref="/"
      />
      <Section
        title="Вітаю!"
        html={
          <>
            <p>
              Мене звати Віталій, я атестований автоінструктор та ветеран ЗСУ.
              Маю міцні нерви, спокійний характер і вмію знаходити підхід до
              кожного учня.
            </p>
            <p>
              Я добре розумію, що навчання водінню може викликати хвилювання чи
              навіть страх — тому на моїх заняттях ви не почуєте криків чи
              тиску. Ми працюємо в атмосфері взаємоповаги, довіри й підтримки.
            </p>
            <p>
              Проводжу навчання у таких районах: Голосіївський район, Теремки,
              Чабани, Гатне, Феофанія, Віта-Поштова.
            </p>
            <p>
              Я підбираю індивідуальний підхід до кожного — враховую ваші
              можливості, сильні та слабкі сторони, спосіб сприйняття інформації
              та психологічні особливості.
            </p>
            <p>
              ‍Моя мета — не просто навчити вас кермувати, а зробити так, щоб ви
              відчули впевненість і спокій за кермом.
            </p>
            <p>
              Для зручності учнів діє електронний запис на заняття, персональний
              календар, а також SMS-нагадування, щоб ви ніколи не пропустили
              свій час.
            </p>
            <p>
              Уже після першого заняття більшість моїх учнів долають свої страхи
              та починають отримувати справжнє задоволення від водіння.
            </p>
            <p>
              Якщо ви мрієте впевнено кермувати —
              <a href="#bookingForm">запрошую на перше заняття</a>
            </p>
            <p>Почнемо цей шлях разом!</p>
          </>
        }
      />
      <Section
        title="Напрямки навчання"
        html={
          <>
            <ul>
              <li>Водіння для початківців з нуля</li>
              <li>
                Підвищення кваліфікації для тих, хто вже має посвідчення водія
              </li>
              <li>
                Відновлення навичок водіння для тих, хто мав перерву в керуванні
                автомобілем
              </li>
              <li>Підготовка до складання практичного іспиту</li>
              <li>
                Можливість проведення як приватних занять, так і реєстрації у
                <a
                  href="https://panda-rav.com/ua"
                  target="_blank"
                  title="Автошкола Панда-Рав"
                >
                  &nbsp;автошколі&nbsp;
                </a>
                для подальшого складання практичного іспиту у сервісному центрі
                МВС
              </li>
            </ul>
          </>
        }
      />
      <Section
        title="Переваги"
        html={
          <>
            <ul>
              <li>
                Ексклюзивна програма занять, яка дозволяє після проходження
                курсу не лише скласти іспит, а й впевнено почуватись за кермом,
                швидко орієнтуватись в будь-яких умовах.
              </li>

              <li>
                Індивідуальний підхід до кожного із врахуванням ваших
                можливостей, сильних та слабких сторін, каналів сприйняття
                інформації, психологічних особливостей.
              </li>
              <li>
                Ввічливе спілкування без криків і тиску. Як відбуваються наші
                заняття можна
                <a href="#videos">&nbsp;переглянути тут&nbsp;</a>
              </li>
              <li>
                Спеціально обладнаний навчальний автомобіль Citroen Cactus з
                автоматичною коробкою передач, камерою заднього виду та
                парктроніком.
              </li>
              <li>
                Перші заняття проводимо на закритій території, що значно
                полегшує перші кроки водіння, зменшує стрес, дозволяє спокійно
                опанувати базові навички.
              </li>
              <li>
                Починаючи з найпростішого, поступово ускладнюємо програму -
                збільшуємо дистанції, їздимо в нові місця, вчимось орієнтуватись
                в незнайомих обставинах.
              </li>
              <li>
                Електронний запис на заняття та персональний календар
                користувача
              </li>
              <li>SMS нагадування про запис на заняття</li>
              <li>
                Підготовка до іспиту шляхом створення умов, максимально
                наближених до реальних, розвиток стресостійкості.
              </li>
              <li>
                Можливість складати іспит на автомобілі, до якого ви звикли
                протягом занять
              </li>
            </ul>
          </>
        }
      />
      <Section
        title="Результат"
        html={
          <>
            <p>
              Вже після першого заняття мої учні долають свої страхи перед
              водінням та з задоволенням записуються на наступні заняття.
            </p>
            <p>
              Наприкінці занять ви зможете впевнено керувати автомобілем на
              дорогах з інтенсивним рухом, таких, як Кільцева дорога або центр
              міста. Спокійно та розсудливо орієнтуватись у незнайомих місцях,
              на складних перехрестях. Майстерно паркувати автомобіль.
              Дотримуватись ПДР, запобігати створенню аварійних ситуацій.
            </p>
            <p className="bold">
              Та головне - ви будете отримувати від водіння почуття задоволення
              та свободи!
            </p>
          </>
        }
      />
    </>
  );
}

export default App;
